# NewtonSecondsPerSquareMeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..NewtonSecondsPerSquareMeter Property
UnitTypeId Class See Also
---
Newton seconds per square meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId NewtonSecondsPerSquareMeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NewtonSecondsPerSquareMeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NewtonSecondsPerSquareMeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace